app/lib/json_web_token.rb

SELECT "salts".* FROM "salts" WHERE "salts"."user_id" = ? LIMIT ?  [["user_id", 1], ["LIMIT", 1]]
INSERT INTO "salts" ("user_id", "salt_str", "token", "created_at", "updated_at") VALUES (?, ?, ?, ?, ?)
SELECT "salts".* FROM "salts" WHERE "salts"."salt_str" = ? LIMIT ?  [["salt_str", "ledzkghkzjykfhdznkpzzlkbdqnyesobdwfqelfiefoppggphh"], ["LIMIT", 1]]
UPDATE "salts" SET "salt_str" = ?, "updated_at" = ? WHERE "salts"."id" = ?  [["salt_str", "hyxbzmyhostkxjvudfhjyrihtvrbuysnsemcirxmgqneemwmuy"], ["updated_at", "2021-01-14 23:16:24.621824"], ["id", 1]]
---
  def self.encode(payload, exp = 24.hours.from_now)

    # set expiry to 24 hours from creation time
    if payload[:user_id] != nil
    salt_record = Salt.where(user_id: payload[:user_id]).take
    payload[:exp] = exp.to_i
    if salt_record == nil
      random_salt = (0...50).map { ('a'..'z').to_a[rand(26)] }.join
      token = JWT.encode(payload, random_salt)
      salt_record = Salt.create!(user_id: payload[:user_id], salt_str: random_salt, token: token)
      salt_record.token
    else
      salt_record.salt_str = random_salt = (0...50).map { ('a'..'z').to_a[rand(26)] }.join
      token = JWT.encode(payload, salt_record.salt_str)
      salt_record.token = token
      salt_record.save

SELECT "salts".* FROM "salts" WHERE "salts"."token" = ? LIMIT ?  [["token", "eyJhbGciOiJIUzI1NiJ9.eyJ1c2VyX2lkIjoxLCJleHAiOjE2MTA5MzM3ODB9.-Z-TQLcmVFWz75fvufRsLxwngVNXd_q7ViDXRN7uIs"], ["LIMIT", 1]]
---
  def self.decode(token)

    salt_record = Salt.where(token: token).take

SELECT "salts".* FROM "salts" WHERE "salts"."user_id" = ? LIMIT ?  [["user_id", 1], ["LIMIT", 1]]
UPDATE "salts" SET "salt_str" = ?, "updated_at" = ? WHERE "salts"."id" = ?  [["salt_str", "eogggmrnghwgpudfdlwdwvmabrhhutsbampyirlauavyqxidny"], ["updated_at", "2021-01-17 02:16:04.203963"], ["id", 1]]
---
  def self.invalidate(user_id)
    #p user_id
    salt_record = Salt.where(user_id: user_id).take
    #p salt_record
    if salt_record == nil
      return " ble"
    else
      salt_record.salt_str = random_salt = (0...50).map { ('a'..'z').to_a[rand(26)] }.join
      salt_record.save