app/lib/json_web_token.rb

  def self.invalidate(token)
    #p user_id
    salt_record = Salt.where(token: token).take
---
SELECT "salts".* FROM "salts" WHERE "salts"."token" = ? LIMIT ?  [["token", "eyJhbGciOiJIUzI1NiJ9.eyJ1c2VyX2lkIjoxLCJleHAiOjE2MTEwMTgwNTF9.o5-kzqZwmwh8bngOIzoRMYTvuehPUNXahSt7evqoQ68"], ["LIMIT", 1]]