app/controllers/todos_controller.rb

INSERT INTO "todos" ("title", "created_by", "created_at", "updated_at") VALUES (?, ?, ?, ?)  [["title", "Beethoven"], ["created_by", "1"], ["created_at", "2021-01-12 22:36:25.521482"], ["updated_at", "2021-01-12 22:36:25.521482"]]
---
  def create
    # create todos belonging to current user
    @todo = current_user.todos.create!(todo_params)

UPDATE "todos" SET "title" = ?, "updated_at" = ? WHERE "todos"."id" = ?  [["title", "Beethoven"], ["updated_at", "2021-01-01 22:38:10.974056"], ["id", 1]]
---
    def update
      @todo.update(todo_params)